; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	infrared2 - mode
	spectrograph0 - mode
	infrared1 - mode
	GroundStation0 - direction
	Star2 - direction
	Star1 - direction
	Star3 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Planet7 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star2)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 149)
	(supports instrument3 spectrograph0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star1)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 126)
	(= (data Phenomenon4 infrared2) 45)
	(= (data Planet5 infrared2) 265)
	(= (data Phenomenon6 infrared2) 105)
	(= (data Planet7 infrared2) 299)
	(= (data Phenomenon4 spectrograph0) 216)
	(= (data Planet5 spectrograph0) 41)
	(= (data Phenomenon6 spectrograph0) 34)
	(= (data Planet7 spectrograph0) 261)
	(= (data Phenomenon4 infrared1) 128)
	(= (data Planet5 infrared1) 264)
	(= (data Phenomenon6 infrared1) 127)
	(= (data Planet7 infrared1) 104)
	(= (slew_time Star2 GroundStation0) 49.23)
	(= (slew_time GroundStation0 Star2) 49.23)
	(= (slew_time Star2 Star1) 85.4)
	(= (slew_time Star1 Star2) 85.4)
	(= (slew_time Star1 GroundStation0) 74.34)
	(= (slew_time GroundStation0 Star1) 74.34)
	(= (slew_time Star3 GroundStation0) 79.23)
	(= (slew_time GroundStation0 Star3) 79.23)
	(= (slew_time Star3 Star1) 45.96)
	(= (slew_time Star1 Star3) 45.96)
	(= (slew_time Star3 Star2) 34.92)
	(= (slew_time Star2 Star3) 34.92)
	(= (slew_time Phenomenon4 GroundStation0) 50.6)
	(= (slew_time GroundStation0 Phenomenon4) 50.6)
	(= (slew_time Phenomenon4 Star1) 35.84)
	(= (slew_time Star1 Phenomenon4) 35.84)
	(= (slew_time Phenomenon4 Star2) 43.98)
	(= (slew_time Star2 Phenomenon4) 43.98)
	(= (slew_time Phenomenon4 Star3) 38.3)
	(= (slew_time Star3 Phenomenon4) 38.3)
	(= (slew_time Planet5 GroundStation0) 2.735)
	(= (slew_time GroundStation0 Planet5) 2.735)
	(= (slew_time Planet5 Star1) 77.39)
	(= (slew_time Star1 Planet5) 77.39)
	(= (slew_time Planet5 Star2) 4.188)
	(= (slew_time Star2 Planet5) 4.188)
	(= (slew_time Planet5 Star3) 11.03)
	(= (slew_time Star3 Planet5) 11.03)
	(= (slew_time Planet5 Phenomenon4) 53.53)
	(= (slew_time Phenomenon4 Planet5) 53.53)
	(= (slew_time Phenomenon6 GroundStation0) 22.44)
	(= (slew_time GroundStation0 Phenomenon6) 22.44)
	(= (slew_time Phenomenon6 Star1) 45.74)
	(= (slew_time Star1 Phenomenon6) 45.74)
	(= (slew_time Phenomenon6 Star2) 42.54)
	(= (slew_time Star2 Phenomenon6) 42.54)
	(= (slew_time Phenomenon6 Star3) 1.278)
	(= (slew_time Star3 Phenomenon6) 1.278)
	(= (slew_time Phenomenon6 Phenomenon4) 6.349)
	(= (slew_time Phenomenon4 Phenomenon6) 6.349)
	(= (slew_time Phenomenon6 Planet5) 8.038)
	(= (slew_time Planet5 Phenomenon6) 8.038)
	(= (slew_time Planet7 GroundStation0) 10.5)
	(= (slew_time GroundStation0 Planet7) 10.5)
	(= (slew_time Planet7 Star1) 28.53)
	(= (slew_time Star1 Planet7) 28.53)
	(= (slew_time Planet7 Star2) 6.07)
	(= (slew_time Star2 Planet7) 6.07)
	(= (slew_time Planet7 Star3) 63.53)
	(= (slew_time Star3 Planet7) 63.53)
	(= (slew_time Planet7 Phenomenon4) 7.101)
	(= (slew_time Phenomenon4 Planet7) 7.101)
	(= (slew_time Planet7 Planet5) 56.94)
	(= (slew_time Planet5 Planet7) 56.94)
	(= (slew_time Planet7 Phenomenon6) 15.62)
	(= (slew_time Phenomenon6 Planet7) 15.62)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Phenomenon6)
	(have_image Phenomenon4 infrared2)
	(have_image Planet5 spectrograph0)
	(have_image Phenomenon6 infrared1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 star1 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 126 to 97.47, (fuel-used) from 0 to 28.53
   goals met: 0 of 4
2. (turn_to satellite0 planet5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 149 to 146.265, (fuel-used) from 28.53 to 31.265
   goals met: 0 of 4
3. (turn_to satellite0 groundstation0 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 146.265 to 143.53, (fuel-used) from 31.265 to 34
   goals met: 0 of 4
4. (turn_to satellite0 planet5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 143.53 to 140.795, (fuel-used) from 34 to 36.735
   goals met: 0 of 4
5. (turn_to satellite0 phenomenon6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 140.795 to 132.757, (fuel-used) from 36.735 to 44.773
   goals met: 1 of 4
6. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 1 of 4
7. (calibrate satellite1 instrument4 star1)
   added: (calibrated instrument4)
   goals met: 1 of 4
8. (turn_to satellite1 star2 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star2)
   changed: (fuel satellite1) from 97.47 to 12.07, (fuel-used) from 44.773 to 130.173
   goals met: 1 of 4
9. (turn_to satellite1 planet5 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet5)
   changed: (fuel satellite1) from 12.07 to 7.882, (fuel-used) from 130.173 to 134.361
   goals met: 1 of 4
10. (turn_to satellite0 planet5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 132.757 to 124.719, (fuel-used) from 134.361 to 142.399
   goals met: 0 of 4
11. (turn_to satellite0 phenomenon6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 124.719 to 116.681, (fuel-used) from 142.399 to 150.437
   goals met: 1 of 4
12. (turn_to satellite0 planet5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 116.681 to 108.643, (fuel-used) from 150.437 to 158.475
   goals met: 0 of 4
13. (turn_to satellite0 phenomenon6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 108.643 to 100.605, (fuel-used) from 158.475 to 166.513
   goals met: 1 of 4
14. (turn_to satellite0 planet5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 100.605 to 92.567, (fuel-used) from 166.513 to 174.551
   goals met: 0 of 4
15. (turn_to satellite0 phenomenon6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 92.567 to 84.529, (fuel-used) from 174.551 to 182.589
   goals met: 1 of 4
16. (turn_to satellite0 planet5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 84.529 to 76.491, (fuel-used) from 182.589 to 190.627
   goals met: 0 of 4
17. (turn_to satellite0 groundstation0 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 76.491 to 73.756, (fuel-used) from 190.627 to 193.362
   goals met: 0 of 4
18. (turn_to satellite0 planet5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 73.756 to 71.021, (fuel-used) from 193.362 to 196.097
   goals met: 0 of 4
19. (turn_to satellite0 phenomenon6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 71.021 to 62.983, (fuel-used) from 196.097 to 204.135
   goals met: 1 of 4
20. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 4
21. (turn_to satellite0 planet5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 62.983 to 54.945, (fuel-used) from 204.135 to 212.173
   goals met: 0 of 4
22. (turn_to satellite0 groundstation0 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 54.945 to 52.21, (fuel-used) from 212.173 to 214.908
   goals met: 0 of 4
23. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 4
24. (turn_to satellite0 phenomenon6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 52.21 to 29.77, (fuel-used) from 214.908 to 237.348
   goals met: 1 of 4
25. (turn_to satellite0 phenomenon4 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 29.77 to 23.421, (fuel-used) from 237.348 to 243.697
   goals met: 0 of 4
26. (take_image satellite0 phenomenon4 instrument0 infrared2)
   added: (have_image phenomenon4 infrared2)
   changed: (data_capacity satellite0) from 1000 to 955, (data-stored) from 0 to 45
   goals met: 1 of 4
27. (turn_to satellite0 phenomenon6 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 23.421 to 17.072, (fuel-used) from 243.697 to 250.046
   goals met: 2 of 4
28. (take_image satellite1 planet5 instrument4 spectrograph0)
   added: (have_image planet5 spectrograph0)
   changed: (data_capacity satellite1) from 1000 to 959, (data-stored) from 45 to 86
   goals met: 3 of 4
29. (take_image satellite0 phenomenon6 instrument0 infrared1)
   added: (have_image phenomenon6 infrared1)
   changed: (data_capacity satellite0) from 955 to 828, (data-stored) from 86 to 213
   goals met: 4 of 4
